NAME: ADREETA GUHA USC ID: 5122431956

In [162]:
import numpy as np
import pandas as pd
df=pd.read_csv('homes.csv')
np.shape(df)
df.shape[0]

522

In [163]:
df[:2]

,price,area,beds,baths,garage,year,style,lotsize,ac,pool,quality,highway
0,360000,3032,4,4,2,1972,1,22221,YES,NO,MEDIUM,NO
1,340000,2058,4,2,2,1976,1,22912,YES,NO,MEDIUM,NO

Q1 SOLUTION:

In [164]:
df['style'].value_counts()

1     214
7     136
3      64
2      58
6      18
5      18
4      11
11      1
10      1
9       1
Name: style, dtype: int64





Q2 SOLUTION (NEXT PAGE):

In [165]:
df.dtypes

price       int64
area        int64
beds        int64
baths       int64
garage      int64
year        int64
style       int64
lotsize     int64
ac         object
pool       object
quality    object
highway    object
dtype: object

In [166]:
df['style']=df['style'].astype(object)
df1=df.loc[:,df.dtypes!=object]
df1.head()

    price  area  beds  baths  garage  year  lotsize
0  360000  3032     4      4       2  1972    22221
1  340000  2058     4      2       2  1976    22912
2  250000  1780     4      3       2  1980    21345
3  205500  1638     4      2       2  1963    17342
4  275500  2196     4      3       2  1968    21786

In [167]:
for col in df1:
    print(col)
    print("Smallest:"+str(df1[col].min()))
    print("Median:"+str(df1[col].median()))
    print("Largest:"+str(df1[col].max()))
    print('\n')

price
Smallest:84000
Median:229900.0
Largest:920000


area
Smallest:980
Median:2061.0
Largest:5032


beds
Smallest:0
Median:3.0
Largest:7


baths
Smallest:0
Median:3.0
Largest:7


garage
Smallest:0
Median:2.0
Largest:7


year
Smallest:1885
Median:1966.0
Largest:1998


lotsize
Smallest:4560
Median:22200.0
Largest:86830

Q3 SOLUTION:

In [168]:
df.loc[df.price==df.price[df.beds>=3].max()]

,price,area,beds,baths,garage,year,style,lotsize,ac,pool,quality,highway
72,920000,3857,4,5,3,1997,1,32793,YES,NO,HIGH,NO

Q4 SOLUTION:

In [169]:
df.loc[(df.beds>=2) & (df.beds<=4) & (df.price>=350000) & (df.area>4000)]

,price,area,beds,baths,garage,year,style,lotsize,ac,pool,quality,highway
73,855000,4756,4,4,3,1990,7,22215,YES,NO,HIGH,NO
77,665000,4746,4,4,3,1996,7,23368,YES,NO,HIGH,NO
80,780000,4419,4,5,7,1987,1,56127,YES,NO,HIGH,NO
154,395000,4150,4,3,3,1934,7,21778,NO,NO,MEDIUM,NO

Q5 SOLUTION:

In [170]:
df.lotsize[df.year>1970].mean()

24145.651785714286

Q6 SOLUTION:

In [171]:
df.price[df.pool=='YES'].mean()-df.price[df.pool=='NO'].mean()

79724.36213991768

Q7 SOLUTION:

In [172]:
set(df["quality"])

{'HIGH', 'LOW', 'MEDIUM'}

In [173]:
print("Lowest prices for each quality:\n",df.groupby("quality").price.agg("min"))
print("Highest prices for each quality:\n",df.groupby("quality").price.agg("max"))

Lowest prices for each quality:
 quality
HIGH      325000
LOW        84000
MEDIUM    140400
Name: price, dtype: int64
Highest prices for each quality:
 quality
HIGH      920000
LOW       359900
MEDIUM    675000
Name: price, dtype: int64

Q8 SOLUTION:

In [174]:
pd.crosstab(df['style'],df.beds,margins=True)

beds   0  1   2    3    4   5   6  7  All
style
1      1  8  46   92   55  11   1  0  214
2      0  0   0   31   24   2   1  0   58
3      0  0   6   34   18   6   0  0   64
4      0  0   3    5    2   1   0  0   11
5      0  0   3    4    6   5   0  0   18
6      0  0   0    7    7   4   0  0   18
7      0  0   6   28   67  23   9  3  136
9      0  0   0    1    0   0   0  0    1
10     0  0   0    0    0   0   1  0    1
11     0  1   0    0    0   0   0  0    1
All    1  9  64  202  179  52  12  3  522

Q9 SOLUTION:

In [175]:
df.groupby('style').get_group(1)[df.price==df.price.min()]

<ipython-input-175-877bced33808>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df.groupby('style').get_group(1)[df.price==df.price.min()]

,price,area,beds,baths,garage,year,style,lotsize,ac,pool,quality,highway
53,84000,980,1,1,1,1951,1,17686,NO,NO,LOW,NO

Q10 SOLUTION:

In [176]:
df['style']=df['style'].astype(object)
df2=df.loc[:,df.dtypes==object]
df2

    style   ac pool quality highway
0       1  YES   NO  MEDIUM      NO
1       1  YES   NO  MEDIUM      NO
2       1  YES   NO  MEDIUM      NO
3       1  YES   NO  MEDIUM      NO
4       7  YES   NO  MEDIUM      NO
..    ...  ...  ...     ...     ...
517     1   NO   NO     LOW      NO
518     6  YES   NO     LOW      NO
519     1   NO   NO     LOW      NO
520     1  YES   NO     LOW      NO
521     1   NO   NO     LOW      NO

[522 rows x 5 columns]

In [177]:
print(df2['style'].value_counts())
print(df2['ac'].value_counts())
print(df2['pool'].value_counts())
print(df2['quality'].value_counts())
print(df2['highway'].value_counts())

1     214
7     136
3      64
2      58
6      18
5      18
4      11
11      1
10      1
9       1
Name: style, dtype: int64
YES    434
NO      88
Name: ac, dtype: int64
NO     486
YES     36
Name: pool, dtype: int64
MEDIUM    290
LOW       164
HIGH       68
Name: quality, dtype: int64
NO     511
YES     11
Name: highway, dtype: int64